Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་དགེ་སློང་དག་གིས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ་
en: The monks asked the Blessed One,

source: བཙུན་པ། བུ་མོ་བདེ་བྱེད་མ་དང་རྒྱལ་པོའི་བུ་དེས་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ལ།
en: “Lord, what actions did young Kṣemā and the king’s son take that ripened into their births into families of great means, prosperity, and wealth;

source: འདི་གཉིས་ཀྱིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེམི་མཉེས་པར་མ་བགྱིས་ནས།
en: that they pleased and did not displease the Blessed One;

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: and that they went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship?”

source: བཙུན་པ་འདི་གཉིས་ཀྱིས་སྨོན་ལམ་གང་དུ་བཏབ་ལགས།
en: “Lord, where did they make these prayers?”

source: སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་
en: “in times past, in this fortunate eon, when people lived as long as twenty thousand years

source: ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ་སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་ཚེ་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན། ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་ཞིག་གནས་པ་དེས།
en: there lived in the city of Vārāṇasī a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་གཉིས་ཀྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས། དེ་གཉིས་གཅིག་ལ་གཅིག་སྨྲས་པ།
en: Then one day they both found faith in the doctrine of the totally and completely awakened Buddha Kāśyapa and said to one another,

source: བཟང་མོ་བདག་ཅག་གཉིས་ལ་བུ་ཡང་མེད་བུ་མོ་ཡང་མེད་པས་འདས་ཏེ་ཤི་བའི་འོག་ཏུ་ཅི་བདོག་པ་འདི་དག་རྒྱལ་པོ་དབང་བར་འགྱུར་གྱིས།
en: ‘Good spouse, seeing as we have neither sons nor daughters, after we die all that we have will become property of the king.

source: བདག་ཅག་གཉིས་གསོན་གྱི་བར་དུ་ཇི་འདི་དག་འཇིག་རྟེན་ཕ་རོལ་ཏུ་བསྐྱའོ་
en: So while we yet live, let us carry only that which we can take with us into the next life.’

source: དེ་བཟའ་བྲན་གཉིས་ཀྱིས་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའི་གཙུག་ལག་ཁང་བརྩིགས་ནས། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་ལ་ཕུལ་ཏེ་ཡོ་བྱད་ཐམས་ཅད་སྦྱར་ནས་དགེ་སློང་རྣམས་ལ་བསྙེན་བཀུར་བྱས་སོ། །
en: “The two spouses built a monastery that was complete in every respect, offered it to the totally and completely awakened Buddha Kāśyapa and the rest of the saṅgha of monks, provided for all their needs, and served them with respect.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་གཉིས་ཀྱི་བློ་སྐྱེས་པ།
en: “One day they had an idea and said,

source: བདག་ཅག་གཉིས་ཁྱིམ་ན་གནས་པ་བཏང་ལ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་རབ་ཏུ་འབྱུང་ངོ་ཞེས་ཟེར་ནས་
en: ‘Let us give up living at home to go forth in the teaching of the totally and completely awakened Buddha Kāśyapa.’

source: ཁྱིམ་གྱི་འཁོར་བཏང་སྟེསྦྱིན་པ་དག་བྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ།
en: Casting away household affairs, they gave gifts and made merit, went forth as novices in the doctrine of the totally and completely awakened Buddha Kāśyapa, and received full ordination.

source: དེ་གཉིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ཀྱང་ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་པས། དེ་གཉིས་ཀྱིས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: “They practiced pure conduct all their lives, and while they may not have attained any great virtues, at the time of their deaths they prayed,

source: ཀྱེ་མ་བདག་ཅག་གཉིས་ཀྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་སྦྱིན་པ་དག་བྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ཏེ་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ཀྱང་ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་ཀྱིས།
en: ‘While we may not have attained any great virtues, still we have gone forth in the doctrine of the totally and completely awakened Buddha Kāśyapa, given gifts, made merit, and practiced pure conduct all our lives.

source: དགེ་བའི་རྩ་བ་འདིས་བདག་ཅག་གཉིས་ཅི་ནས་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་ཤོག་ཅིག །གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་ཤོག་ཅིག །
en: By this root of virtue, wherever we are born, may it be into families of great means, prosperity, and wealth, and may we be well proportioned, pleasing to the eye, and beautiful.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་ཅག་གཉིས་ཀྱིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: May we please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: དེའི་ཚེ་བཟའ་བྲན་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་གཉིས་ནི་བདེ་བྱེད་མ་འདི་ཉིད་དང་རྒྱལ་པོའི་བུ་འདི་ཉིད་ཡིན་ཏེ།
en: The two who were married then are none other than Kṣemā and the king’s son.

source: དེ་གཉིས་ཀྱིས་དེར་སྦྱིན་པ་དག་བྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ནས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ། འཆི་ཀར་སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ལ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་གྱུར་ཏེ
en: The acts of giving gifts, making merit, practicing pure conduct all their lives, and praying at the time of their deaths ripened such that wherever they were born, it was into families of great means, prosperity, and wealth, and they were well proportioned, pleasing to the eye, and beautiful.

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་ཤིན་ཏུ་མཉམ་པ་དང་ཤུགས་མཉམ་པ་དང་མཛད་པ་མཉམ་པ་དང་ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས། འདི་གཉིས་ཀྱིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།། །།
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—that they have pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.”

source: ནོར་བུའི་འོད་ཅེས་བྱ་བ་ནི།
en: The Story of Maṇiprabha

source: དེའི་ཚེ་ལྷའི་བུ་ནོར་བུའི་འོད་ཅེས་བྱ་བ་རྣ་ཆ་གདུབ་ཀོར་དག་ཅིང་འགུལ་བ་ཐོགས་པ། ལུས་དོ་ཤལ་དང་སེ་མོ་དོས་མཛེས་པར་བྱས་པ།
en: When the Blessed One was in Śrāvastī there was a young god named Maṇiprabha, who had hoops in his ears and necklaces around his neck, and whose body was graced with strings of precious stones.

source: ལྷའི་ནོར་བུ་རིན་པོ་ཆེའི་གཞལ་མེད་ཁང་འོད་ཤིན་ཏུ་ཆེ་བ་དང་ལྡན་པ།
en: He had a luminous celestial mansion of exquisite, divine jewels.

source: འོད་འཕགས་པ་དེས་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་རྣམས་ཀྱིས་ཐུ་བ་བཀང་སྟེནམ་སྲོས་པ་དང་མཉན་དུ་ཡོད་པའི་ནང་དུ་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་སོང་ནས།
en: This exalted being of light filled the front of his long shirt with divine flowers—lotus, blue lotus, white water lily, and white lotus flowers—and when night had fallen he went to the garden of Prince Jeta in Śrāvastī to see the Blessed One.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ལ་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་རྣམས་དང་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དག་གིས་གཏོར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: Upon his arrival, he scattered the divine blue lotus, lotus, white water lily, white lotus, and mandārava flowers over the Blessed One, touched his head to the Blessed One’s feet, and sat before him to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་བསམ་པ་དང་བག་ལ་ཉལ་དང་ཁམས་དང་རང་བཞིན་ཐུགས་སུ་ཆུད་ནས། དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended his thoughts, habitual tendencies, temperament, and nature, and taught him the Dharma accordingly.

source: དེ་ཐོས་ནས་ལྷའི་བུ་དེས་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ
en: Hearing it, the young god destroyed the twenty high peaks of the mountain of views concerning the transitory collection with the thunderbolt of wisdom, and manifested the resultant state of stream entry right where he sat.

source: དེས་བདེན་པ་མཐོང་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ། །
en: Having seen the truths, he touched his head to the Blessed One’s feet, circumambulated him three times, and disappeared on the spot.

source: དེའི་ཚེ་དགེ་སློང་སྲོད་དང་ཐོ་རངས་མི་ཉལ་བར་བརྩོན་པ་ལྷུར་ལེན་པ་ལ་གནས་པ་དེ་དག་གིས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ཐམས་ཅད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་པ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་དེ་དག་གིས་བསམས་པ།
en: When that happened, the monks, who were making continued, earnest, and sleepless efforts at dusk and dawn, noticed that the garden of Prince Jeta was suffused with a great light and wondered,

source: ཅི་མདང་སུམ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པའམ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ནམ། རྒྱལ་པོ་ཆེན་པོ་བཞི་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འོངས་སམ་
en: “What was this? Last night, did Sahāṃpati Brahmā, or Śakra, King of the Gods—or perhaps the four great kings—come to offer respect to the Blessed One?”

source: སྙམ་ནསབཅོམ་ལྡན་འདས་ལ་དོན་དེ་ཞུས་པ། བཙུན་པ་ཅི་ལགས་མདང་སུམ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པའམ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ནམ་རྒྱལ་པོ་ཆེན་པོ་བཞི་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་སླད་དུ་མཆིས་ལགས་སམ།
en: Thinking this, they asked the Blessed One, “Lord, last night, did Sahāṃpati Brahmā, or Śakra, King of the Gods—or perhaps the four great kings—come to see the Blessed One?”

source: མདང་སུམ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པའམ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ནམ། འཇིག་རྟེན་སྐྱོང་བ་བཞི་ང་ལ་བལྟ་བའི་ཕྱིར་འོངས་པ་མ་ཡིན་གྱི། ལྷའི་བུ་ནོར་བུའི་འོད་ལྷའི་གཞལ་མེད་ཁང་འོད་ཤིན་ཏུ་ཆེ་བ་དང་ལྡན་པ། འོད་འཕགས་པ་དེ་མདང་སུམ་ང་ལ་བལྟ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འོངས་ནས
en: “last night it was neither Sahāṃpati Brahmā, nor Śakra, King of the Gods, nor the four great kings who came to see me, but rather a young god named Maṇiprabha, a very exalted being of light with a luminous celestial mansion of exquisite, divine jewels, who came to see me and to offer his respect.

source: དེ་འོངས་པ་ལ་ངས་ཆོས་བསྟན་ཏེ། དེས་ང་ལས་ཆོས་ཐོས་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: I taught him the Dharma, and after he heard the Dharma from me he manifested the resultant state of stream entry.

source: དེས་བདེན་པ་མཐོང་ནས་རང་གི་གནས་སུ་སོང་ངོ་། །
en: Having seen the truths, he went back to where he belongs.”

source: བཙུན་པ་ལྷའི་བུ་དེས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ལྷར་སྐྱེས་ཏེ། ནོར་བུ་རིན་པོ་ཆེའི་གནས་སུ་གྲུབ་པར་གྱུར་ལ། བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ། མི་མཉེས་པར་མ་བགྱིས་ལགས།
en: “Lord, what action did Maṇiprabha take that ripened into his birth as a god, that he attained a luminous celestial mansion of exquisite, divine jewels, and that he pleased the Blessed One, and did not displease him?”

source: ནོར་བུའི་འོད་འདི་ཉིད་ཀྱིས་སྔོན་ལས་བྱས་ཤིང་བསགས་ཏེ། དགེ་སློང་དག་ལས་བྱས་ཤིང་བསགས་པ་རྣམས་ནི།
en: “Maṇiprabha committed and accumulated the actions himself at a previous time.

source: ཕྱི་རོལ་གྱི་སའི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར་ལ། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར་ཏེ
en: The actions he committed and accumulated did not ripen into the external element of earth. They did not ripen into the element of water, nor the element of fire, nor the element of wind.

source: ལས་དགེ་བ་དང་མི་དགེ་བ་བྱས་ཤིང་བསགས་པ་རྣམས་ནི། ཟིན་པའི་ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་རྣམས་འབའ་ཞིག་ལ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: The actions he committed and accumulated, both virtuous and nonvirtuous, ripened into nothing but his own aggregates, sense bases, and constituent elements.

source: ལུས་ཅན་དག་གི་ལས་རྣམས་ནི། །བསྐལ་པ་བརྒྱར་ཡང་ཆུད་མི་ཟ། །ཚོགས་ཤིང་དུས་ལ་བབ་པ་ན། འབྲས་བུ་ཉིད་དུ་སྨིན་པར་འགྱུར། །
en: “When the time arrives—and even if A hundred eons pass— Fruit is born of every act That sentient beings amass.

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ་སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks, in times past, in this fortunate age when people lived as long as twenty thousand years and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་ཚེ་བཱ་རཱ་ཎ་སཱི་ན། ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་དེས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་དབུ་སྐྲ་དང་སེན་མོ་བླངས་ནས
en: there lived in Vārāṇasī a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: དབུ་སྐྲ་དང་སེན་མོའི་མཆོད་རྟེན་དང་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའི་གཙུག་ལག་ཁང་བརྩིགས་ཏེ། དེས་གཙུག་ལག་ཁང་དེར་ཡོ་བྱད་ཐམས་ཅད་ཕུལ་ལོ། །
en: “That householder constructed a stūpa enshrining the hair and nail relics of the totally and completely awakened Buddha Kāśyapa, and a monastery that was complete in every respect, and he provided for all the monastery’s needs.

source: མཆོད་རྟེན་དེའི་ཆར་ཁབ་ལ་ཡང་ནོར་བུ་རིན་པོ་ཆེ་བཏགས་ཏེ། དེའི་མཐུས་མཆོད་རྟེན་དང་བཅས་པའི་གཙུག་ལག་ཁང་དེ་མཚན་མོ་ཡང་ཉིན་མོ་བཞིན་དུ་སྣང་བར་གྱུར་ཏོ། །
en: Even the rain gutters of the stūpa dangled with jewels, such that the monastery associated with it shone night and day.

source: དེ་ནས་དེས་གཙུག་ལག་ཁང་དེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་ལ་ཕུལ་ལོ། །
en: He offered the monastery to the Blessed Buddha Kāśyapa and the rest of the saṅgha of monks.

source: དགེ་སློང་རྣམས་ལ་ཡང་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་སོ། །
en: He also offered his respectful service to the monks, and provided for all their needs.

source: ཚེ་གཅིག་ཏུ་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་ཀྱང་བསྲུངས་ནས། ལྷའི་ནང་དུ་སྐྱེས་སོ། །དེར་སྐྱེས་ནས་དེའི་ནོར་བུ་རིན་པོ་ཆེའི་གཞལ་མེད་ཁང་གྲུབ་པར་གྱུར་ཏོ། །
en: After going for refuge and maintaining the fundamental precepts all his life, he took birth among the gods, where he obtained a celestial mansion of exquisite jewels.

source: དེའི་ཚེ་ཁྱིམ་བདག་གང་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་མཆོད་རྟེན་དང་བཅས་པའི་གཙུག་ལག་ཁང་བརྩིགས་ནས་ནོར་བུ་རིན་པོ་ཆེ་བཏགས་པ་དེ་ནི། ལྷའི་བུའི་ནོར་བུའི་འོད་འདི་ཡིན་ཏེདེས་དེར་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའི་མཆོད་རྟེན་དང་བཅས་པའི་གཙུག་ལག་ཁང་བརྩིགས་ཏེ།
en: The householder who at that time built the reliquary stūpa enshrining the totally and completely awakened Buddha Kāśyapa and his teachings, and the monastery associated with it, and who hung jewels on the stūpa, is none other than the young god Maṇiprabha.

source: བཅོམ་ལྡན་འདས་འོད་སྲུང་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་ལ་ཕུལ་བ་དང་མཆོད་རྟེན་དེ་ལ་ནོར་བུ་རིན་པོ་ཆེ་བཏགས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ལྷའི་ནང་དུ་སྐྱེས་ཏེ།
en: The acts of building the reliquary stūpa and the associated monastery, complete in every respect, offering them to the Blessed Buddha Kāśyapa and the rest of the saṅgha of monks, and hanging jewels on the stūpa ripened into his taking birth among the gods.

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་ཤིན་ཏུ་མཉམ་པ་དང་ཤུགས་མཉམ་པ་དང་མཛད་པ་མཉམ་པ་དང་ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས། འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་སོ།། །།
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—that he has pleased me and not displeased me.”

source: སྣ་མའི་མེ་ཏོག་ཅེས་བྱ་བ་ནི།
en: The Story of Jasmine

source: དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན། ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་
en: When the Blessed One was in Śrāvastī there lived a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: དེས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནསདེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས།
en: When the time came for him to marry he took a wife, and they enjoyed themselves and coupled.

source: ཁྱིམ་བདག་དེ་བུ་མེད་དེ་བུ་འདོད་པའི་ཕྱིར་ལྷ་རྣམས་ལ་ཡང་གསོལ་བ་འདེབས་ཏེ།
en: The householder had no heir and desired a son, so he supplicated the gods.

source: ལྷ་གུ་ལང་དང་། ཆུ་ལྷ་དང་ཀུ་བེ་ར་དང་བརྒྱ་བྱིན་དང་ཚངས་པ་ལ་སོགས་པ་དང་ཀུན་དགའ་ར་བའི་ལྷ་དང་། ནགས་ཚལ་གྱི་ལྷ་དང་ལམ་གྱི་བཞི་མདོའི་ལྷ་དང་སུམ་མདོའི་ལྷ་དང་གཏོར་མ་ལེན་པའི་ལྷ་དང་ལྷན་ཅིག་སྐྱེས་པ་དང་ཆོས་འཐུན་པ་དང་རྟག་ཏུ་ཕྱི་བཞིན་འབྲང་བའི་ལྷ་རྣམས་ལ་ཡང་གསོལ་བ་འདེབས་ལ།
en: He prayed to Paśupati, Varuṇa, Kubera, Śakra, Brahmā, and the rest, and to the deities of the pleasure groves, the forest deities, the deities of the crossroads, the deities of forks in the road, the deities who receive strewn oblations, the deities of his inherited tradition, and the deities who are in constant attendance of righteous persons.

source: འཇིག་རྟེན་ན་ཡང་གསོལ་བ་བཏབ་པའི་རྒྱུས་བུ་དང་བུ་མོ་སྐྱེ་བར་འགྱུར་རོ། །ཞེས་གྲགས་མོད་ཀྱི་དེ་ཡང་དེ་ལྟ་ནི་མ་ཡིན་ཏེ་། གལ་ཏེ་གསོལ་བ་བཏབ་པའི་རྒྱུས་བུ་དང་བུ་མོ་སྐྱེ་བར་འགྱུར་དུ་ཟིན་ན་
en: While it is often said that praying to deities can cause a boy or girl to be born, this is not true.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བཞིན་དུ། རེ་རེ་ལ་ཡང་བུ་སྟོང་སྟོང་ཡོད་པར་འགྱུར་བའི་རིགས་ཏེ
en: If children could be made just by praying, every family would have them a thousand times over, like a universal monarch.

source: དེ་ནི་གནས་གསུམ་ཚོགས་པ་ལས། བུ་དང་བུ་མོ་སྐྱེ་བར་འགྱུར་ཏེ།
en: In fact, there are three circumstances that allow for the birth of a child:

source: ཕ་མ་གཉིས་འདོད་ཆགས་ལངས་ཏེ་ཕྲད་པ་དང་མ་དུས་ལ་བབ་ཅིང་
en: a child is born when (1) lust arises in the parents and they have intercourse,

source: ཟླ་མཚན་དང་ལྡན་པ་དང་དྲི་ཟ་འོངས་པ་སྟེ། དྲི་ཟའི་སེམས་ཀྱང་རྗེས་སུ་ཆགས་པ་དང་ལྡན་པའམ། ཁོང་ཁྲོ་བ་དང་ལྡན་པ་རྣམ་པ་གཉིས་ལས་གང་ཡང་རུང་བ་སྐྱེས་པའོ། །
en: (2) the mother still has her menstrual cycle and is approached by a gandharva, and (3) the gandharva’s mind is either attached or angry.

source: དེ་ནས་དེ་ཡང་གསོལ་བ་འདེབས་པ་ལྷུར་བྱེད་ལ། སེམས་ཅན་ཆེན་པོ་ཆེ་བར་གྲགས་པ། སྲིད་པ་ཐ་མ་བཙལ་བར་བྱ་བ་རྙེད་པ་ཐར་པའི་སྐལ་བ་ཅན་དུ་གྱུར་པ། ཚོགས་བསགས་པ་མྱ་ངན་ལས་འདས་པ་ལ་ནང་དུ་བལྟས་པ། འཁོར་བ་ལས་ཕྱི་རོལ་ཏུ་བལྟས་པ་སྲིད་པར་འགྲོ་བའི་སྐྱེ་གནས་རྣམས་མི་འདོད་པ་ལུས་ཀྱི་ཐ་མ་འཛིན་པ་ཞིག་ཀྱང་དེའི་ཆུང་མའི་མངལ་དུ་སྐྱེས་སོ། །
en: Nevertheless, he remained intent on his prayers, and a great being took birth in his wife’s womb who was well renowned and had gained his final birth, had the good fortune to soon be liberated due to gathering the accumulations, had his sights set on nirvāṇa and had turned away from saṃsāra, had no desire for the states of rebirth in cyclic existence, and who had now assumed his final body.

source: སྐྱེས་པ་ཆགས་པར་ཡང་ཤེས་ལ་མ་ཆགས་པར་ཡང་ཤེས་པ་དང་།
en: She knows (1) whether a man is attracted to her,

source: དུས་ཀྱང་ཤེས་ལ་ཟླ་མཚན་ཡང་ཤེས་པ་དང་།
en: (2) the time of her menstrual cycle,

source: བུ་ཆགས་པ་ཤེས་པ་དང་གང་ལས་ཆགས་པ་ཤེས་པ་དང་ཁྱེའུ་ཡང་ཤེས་ལ་བུ་མོ་ཡང་ཤེས་པ་སྟེ། གལ་ཏེ་ཁྱེའུ་ཡིན་ན་ནི་ལྟོ་གཡས་ལོགས་སུ་རྟེན་ཅིང་གནས་སོ། །གལ་ཏེ་བུ་མོ་ཡིན་ན་ནི་ལྟོ་གཡོན་ལོགས་སུ་རྟེན་ཅིང་གནས་སོ། །
en: (3) that she has conceived, (4) from whom she has conceived, and (5) whether the child is a boy or a girl, for if it is a baby boy it will stay on the right side of the womb, and if it is a girl it will stay on the left side of the womb.

source: དེ་ནས་གང་གི་ཚེ་དེ་ལ་བུ་ཆགས་པར་འགྱུར་བ་དེའི་ཚེ། དེ་དགའ་ཆེས་ནས་ཁྱིམ་ཐབ་ལ་སྦྲན་པ།
en: When the householder’s wife conceived a child, she was overjoyed and told her husband,

source: ཇོ་བོ་བདག་ལ་སྲས་ཆགས་ཏེ་བདག་གི་རུམ་གཡས་ལོགས་སུ་རྟེན་ཅིང་གནས་པ་ལས་ཁྱེའུར་འགྱུར་བར་ངེས་ཀྱིས་དགྱེས་པ་བསྐྱེད་དུ་གསོལ་ཞེས་བྱས་ནས
en: “My Lord, I have conceived a boy. He is staying on the right side of my womb, so rejoice, for it is sure to be a boy!”

source: དེ་ཡང་དགའ་ཆེས་ཏེ། རོ་སྟོད་ནི་བཏེག་ལག་པ་གཡས་པ་ནི་བརྐྱང་ནས།
en: At this the householder too was very happy. He puffed out his chest, put his right hand in the air, and expressed his joy, saying,

source: བདག་གིས་ཡུན་རིང་པོ་ནས། སྨོན་སྨོན་པའི་བུའི་ངོ་མཐོང་བར་འོང་ངོ་། །
en: “I shall see the face of the son for whom I have prayed for so long!

source: བདག་གི་བུ་རུང་བར་གྱུར་ཅིག་མི་རུང་བར་མ་གྱུར་ཅིག་བདག་གི་བྱ་བ་དག་བྱེད་པར་ཤོག་ཅིག །
en: May everything be right with my son, may nothing go wrong with him, and may he carry on my work!

source: གསོས་ན་གསོས་པའི་ལན་ཕྱིར་གསོ་བར་ཤོག་ཅིག །
en: As I care for him, may he care for me in return!

source: ནོར་སྐལ་ལ་སྤྱོད་པར་ཤོག་ཅིག །
en: May he enjoy my inheritance!

source: བདག་གི་རིགས་རྒྱུད་ཡུན་རིང་དུ་གནས་པར་ཤོག་ཅིག །
en: May my lineage endure for a long time!

source: བདག་ཅག་འདས་ཏེ་ཤི་བའི་འོག་ཏུ་ཡང་བདག་ཅག་གི་ཕྱིར་མང་ཡང་རུང་ཉུང་ཡང་རུང་སྟེ།
en: And after our passing, when we die, may he give gifts, be they great or small, and make merit!

source: སྦྱིན་པ་དག་བྱིན་ལ་བསོད་ནམས་དག་བྱས་ནས་
en: When he does, may he dedicate the merit thus:

source: དེ་གཉིས་གང་དང་གང་དུ་སྐྱེས་ཤིང་འགྲོ་བ་དེར་འདི་སོང་ཤིག་ཅེས་ཡོན་སྔོ་བར་ཤོག་ཅིག་ཅེས་
en: ‘Wherever these two are born, may this go to them!’

source: གྲང་བའི་ཚེ་གྲང་བའི་ཡོ་བྱད་རྣམས་དང་ཚ་བའི་ཚེ་ཚ་བའི་ཡོ་བྱད་རྣམས་དང་སྨན་པས་བསྟན་པའི་ཟས་རྣམས་དང་ཧ་ཅང་ཁ་བ་མ་ཡིན་པ་རྣམས་དང་ཧ་ཅང་སྐྱུར་བ་མ་ཡིན་པ་རྣམས་དང་ཧ་ཅང་ལན་ཚྭ་ཆེ་བ་མ་ཡིན་པ་རྣམས་དང་ཧ་ཅང་མངར་བ་མ་ཡིན་པ་རྣམས་དང་ཧ་ཅང་རོ་ཚ་བ་མ་ཡིན་པ་རྣམས་དང་ཧ་ཅང་བསྐ་བ་མ་ཡིན་པ་རྣམས་ཏེ། ཁ་བ་དང་སྐྱུར་བ་དང་ལན་ཚྭ་དང་མངར་བ་དང་ཚ་བ་དང་བསྐ་བ་མེད་པའི་ཟས་རྣམས་ཀྱིས་བསྟེན་ཅིང་།
en: He provided her with what she needed for winter in the winter, what she needed for summer in the summer, with food that was not too bitter, too sour, too salty, too sweet, too spicy, or too astringent as instructed by the healer, and he served her food that was not bitter, sour, salty, sweet, spicy, or astringent.

source: དོ་ཤལ་དང་སེ་མོ་དོས་ལུས་རྣམ་པར་བཀླུབས་ཏེ། ལྷའི་བུ་མོ་དགའ་བའི་ཚལ་ན་རྣམ་པར་རྒྱུ་བ་བཞིན་དུ་ཁྲིའི་སྟེང་ནས་ཁྲིའི་སྟེང་དང་ཁྲིའུའི་སྟེང་ནས། ཁྲིའུའི་སྟེང་དུ་རྒྱུ་ཞིང་འོག་གི་ས་གཞི་ལ་མི་འབབ་པ་དང་། དེས་ཡིད་དུ་མི་འོང་བའི་སྒྲ་སྐད་ཅི་ཡང་མི་ཐོས་པར་བྱས་སོ། །
en: He draped her body with garlands and strings of precious stones, and he moved her from divan to divan and seat to seat like a goddess through a joyous garden, never letting her descend to the ground, never letting her hear an unpleasant word even for a moment.
